console.log('2'+2 - '2');
let a=5;
console.log(10-a);
let s=prompt('Как вас зовут?');
console.log('Привет,'+s);
const b=10;
a=20;
// b=200 менять контанту нельзя
a++; //увеличиваем значение переменой а на 1  21   
a--; //уменьшает значение переменой а на 1   20
a=a+5;//увеличеваем переменную на 5   25
a+=5; //то же самое  30
a*=3;//тоже самое что и а= а*3 - увеличение переменной в 3 раза  90
a/=2;//45
let c= a%2;//остаток от деления а(45) на 2
console.log('a = '+ a);
console.log(c);
let m = [10,20,30,];//сщздали масив из 3чисел
console.log(m);//выводим весь масив
console.log(m[1]);//выводим второй элемент массива (нумерация с нуля)
m[2]=35//поменяли значение 3го элемента массива
console.log(m);
m[2]++;
console.log(m);

